dannyf00/ARMduino/LPC17xx/armduino_lpc17xx.c
//hardware specific port for ARMduino to STM32F10x family

//#include "armduino_lpc17xx.h"						//we use aruidno GPIO port for stm32F
#include "armduino.h"								//use ARMduino specific definitions

//global definitions

#define PWM_PR			((1ul<<PWMOUT_BITs) - 1)			//period for 16-bit pwm

//struct used to map a pin to GPIO+mask
typedef struct {
	LPC_GPIO_TypeDef *gpio;					//gpio for a pin
	uint32_t mask;						//pin mask - 16bit
} PIN2GPIO;


//empty handler
static void empty_handler(void) {
	//do nothing here
}

#if defined(USE_EXTI)
//user isr
void (*_isrptr_exti[16])(void);			//user handler for EXTI interrupt

//exti interrupt handlers
void EXTI0_IRQHandler(void) {
	EXTI->PR |= (1<<0);					//clear the flag by writing '1' to it
	_isrptr_exti[0]();					//execute the user handler
}

void EXTI1_IRQHandler(void) {
	EXTI->PR |= (1<<1);					//clear the flag by writing '1' to it
	_isrptr_exti[1]();					//execute the user handler
}

void EXTI2_IRQHandler(void) {
	EXTI->PR |= (1<<2);					//clear the flag by writing '1' to it
	_isrptr_exti[2]();					//execute the user handler
}

void EXTI3_IRQHandler(void) {
	EXTI->PR |= (1<<3);					//clear the flag by writing '1' to it
	_isrptr_exti[3]();					//execute the user handler
}

void EXTI4_IRQHandler(void) {
	EXTI->PR |= (1<<4);					//clear the flag by writing '1' to it
	_isrptr_exti[4]();					//execute the user handler
}

void EXTI9_5_IRQHandler(void) {
	if (EXTI->PR & (1<<5)) {
		EXTI->PR |= (1<<5);				//clear the flag by writing '1' to it
		_isrptr_exti[5]();				//execute the user handler
	}

	if (EXTI->PR & (1<<6)) {
		EXTI->PR |= (1<<6);				//clear the flag by writing '1' to it
		_isrptr_exti[6]();				//execute the user handler
	}

	if (EXTI->PR & (1<<7)) {
		EXTI->PR |= (1<<7);				//clear the flag by writing '1' to it
		_isrptr_exti[7]();				//execute the user handler
	}

	if (EXTI->PR & (1<<8)) {
		EXTI->PR |= (1<<8);				//clear the flag by writing '1' to it
		_isrptr_exti[8]();				//execute the user handler
	}

	if (EXTI->PR & (1<<9)) {
		EXTI->PR |= (1<<9);				//clear the flag by writing '1' to it
		_isrptr_exti[9]();				//execute the user handler
	}
}

void EXTI15_10_IRQHandler(void) {
	if (EXTI->PR & (1<<10)) {
		EXTI->PR |= (1<<10);			//clear the flag by writing '1' to it
		_isrptr_exti[10]();				//execute the user handler
	}

	if (EXTI->PR & (1<<11)) {
		EXTI->PR |= (1<<11);			//clear the flag by writing '1' to it
		_isrptr_exti[11]();				//execute the user handler
	}

	if (EXTI->PR & (1<<12)) {
		EXTI->PR |= (1<<12);			//clear the flag by writing '1' to it
		_isrptr_exti[12]();				//execute the user handler
	}

	if (EXTI->PR & (1<<13)) {
		EXTI->PR |= (1<<13);			//clear the flag by writing '1' to it
		_isrptr_exti[13]();				//execute the user handler
	}

	if (EXTI->PR & (1<<14)) {
		EXTI->PR |= (1<<14);			//clear the flag by writing '1' to it
		_isrptr_exti[14]();				//execute the user handler
	}

	if (EXTI->PR & (1<<15)) {
		EXTI->PR |= (1<<15);			//clear the flag by writing '1' to it
		_isrptr_exti[15]();				//execute the user handler
	}
}
//end exti handlers
#endif

//global variables
//define your chips here
//declare pins based on chip packaging
//ALL PINS ARE MAPPED, WHETHER THEY EXIST OR NOT
//*********************************************************
//SO MAKE SURE THAT THE PINS YOU PICKED ACTUALLY EXIST FOR YOUR CHIP/PACKAGE
//*********************************************************
//Pin  0..15 -> GPIOA
//Pin 16..31 -> GPIOB
//Pin 32..47 -> GPIOC
//Pin 48..63 -> GPIOD
//Pin 64..79 -> GPIOE
//Pin 80..95 -> GPIOF
//Pin 96..111 -> GPIOG
const PIN2GPIO GPIO_PinDef[]={
		{LPC_GPIO0, 1<< 0},						//ARMduino Pin  0 = PA0
		{LPC_GPIO0, 1<< 1},						//ARMduino Pin  1 = PA1
		{LPC_GPIO0, 1<< 2}, 					//ARMduino Pin  2 = PA2
		{LPC_GPIO0, 1<< 3},						//ARMduino Pin  3 = PA3
		{LPC_GPIO0, 1<< 4},						//ARMduino Pin  4 = PA4
		{LPC_GPIO0, 1<< 5},						//ARMduino Pin  5 = PA5
		{LPC_GPIO0, 1<< 6},						//ARMduino Pin  6 = PA6
		{LPC_GPIO0, 1<< 7},						//ARMduino Pin  7 = PA7
		{LPC_GPIO0, 1<< 8},						//ARMduino Pin  8 = PA8
		{LPC_GPIO0, 1<< 9},						//ARMduino Pin  9 = PA9
		{LPC_GPIO0, 1<<10},						//ARMduino Pin 10 = PA10
		{LPC_GPIO0, 1<<11},						//ARMduino Pin 11 = PA11
		{LPC_GPIO0, 1<<12},						//ARMduino Pin 12 = PA12
		{LPC_GPIO0, 1<<13},						//ARMduino Pin 13 = PA13
		{LPC_GPIO0, 1<<14},						//ARMduino Pin 14 = PA14
		{LPC_GPIO0, 1<<15},						//ARMduino Pin 15 = PA15
		{LPC_GPIO0, 1<<16},						//ARMduino Pin  0 = PA0
		{LPC_GPIO0, 1<<17},						//ARMduino Pin  1 = PA1
		{LPC_GPIO0, 1<<18}, 					//ARMduino Pin  2 = PA2
		{LPC_GPIO0, 1<<19},						//ARMduino Pin  3 = PA3
		{LPC_GPIO0, 1<<20},						//ARMduino Pin  4 = PA4
		{LPC_GPIO0, 1<<21},						//ARMduino Pin  5 = PA5
		{LPC_GPIO0, 1<<22},						//ARMduino Pin  6 = PA6
		{LPC_GPIO0, 1<<23},						//ARMduino Pin  7 = PA7
		{LPC_GPIO0, 1<<24},						//ARMduino Pin  8 = PA8
		{LPC_GPIO0, 1<<25},						//ARMduino Pin  9 = PA9
		{LPC_GPIO0, 1<<26},						//ARMduino Pin 10 = PA10
		{LPC_GPIO0, 1<<27},						//ARMduino Pin 11 = PA11
		{LPC_GPIO0, 1<<28},						//ARMduino Pin 12 = PA12
		{LPC_GPIO0, 1<<29},						//ARMduino Pin 13 = PA13
		{LPC_GPIO0, 1<<30},						//ARMduino Pin 14 = PA14
		{LPC_GPIO0, 1<<31},						//ARMduino Pin 15 = PA15
	
		{LPC_GPIO1, 1<< 0},						//ARMduino Pin  0 = PA0
		{LPC_GPIO1, 1<< 1},						//ARMduino Pin  1 = PA1
		{LPC_GPIO1, 1<< 2}, 					//ARMduino Pin  2 = PA2
		{LPC_GPIO1, 1<< 3},						//ARMduino Pin  3 = PA3
		{LPC_GPIO1, 1<< 4},						//ARMduino Pin  4 = PA4
		{LPC_GPIO1, 1<< 5},						//ARMduino Pin  5 = PA5
		{LPC_GPIO1, 1<< 6},						//ARMduino Pin  6 = PA6
		{LPC_GPIO1, 1<< 7},						//ARMduino Pin  7 = PA7
		{LPC_GPIO1, 1<< 8},						//ARMduino Pin  8 = PA8
		{LPC_GPIO1, 1<< 9},						//ARMduino Pin  9 = PA9
		{LPC_GPIO1, 1<<10},						//ARMduino Pin 10 = PA10
		{LPC_GPIO1, 1<<11},						//ARMduino Pin 11 = PA11
		{LPC_GPIO1, 1<<12},						//ARMduino Pin 12 = PA12
		{LPC_GPIO1, 1<<13},						//ARMduino Pin 13 = PA13
		{LPC_GPIO1, 1<<14},						//ARMduino Pin 14 = PA14
		{LPC_GPIO1, 1<<15},						//ARMduino Pin 15 = PA15
		{LPC_GPIO1, 1<<16},						//ARMduino Pin  0 = PA0
		{LPC_GPIO1, 1<<17},						//ARMduino Pin  1 = PA1
		{LPC_GPIO1, 1<<18}, 					//ARMduino Pin  2 = PA2
		{LPC_GPIO1, 1<<19},						//ARMduino Pin  3 = PA3
		{LPC_GPIO1, 1<<20},						//ARMduino Pin  4 = PA4
		{LPC_GPIO1, 1<<21},						//ARMduino Pin  5 = PA5
		{LPC_GPIO1, 1<<22},						//ARMduino Pin  6 = PA6
		{LPC_GPIO1, 1<<23},						//ARMduino Pin  7 = PA7
		{LPC_GPIO1, 1<<24},						//ARMduino Pin  8 = PA8
		{LPC_GPIO1, 1<<25},						//ARMduino Pin  9 = PA9
		{LPC_GPIO1, 1<<26},						//ARMduino Pin 10 = PA10
		{LPC_GPIO1, 1<<27},						//ARMduino Pin 11 = PA11
		{LPC_GPIO1, 1<<28},						//ARMduino Pin 12 = PA12
		{LPC_GPIO1, 1<<29},						//ARMduino Pin 13 = PA13
		{LPC_GPIO1, 1<<30},						//ARMduino Pin 14 = PA14
		{LPC_GPIO1, 1<<31},						//ARMduino Pin 15 = PA15
	
		{LPC_GPIO2, 1<< 0},						//ARMduino Pin  0 = PA0
		{LPC_GPIO2, 1<< 1},						//ARMduino Pin  1 = PA1
		{LPC_GPIO2, 1<< 2}, 					//ARMduino Pin  2 = PA2
		{LPC_GPIO2, 1<< 3},						//ARMduino Pin  3 = PA3
		{LPC_GPIO2, 1<< 4},						//ARMduino Pin  4 = PA4
		{LPC_GPIO2, 1<< 5},						//ARMduino Pin  5 = PA5
		{LPC_GPIO2, 1<< 6},						//ARMduino Pin  6 = PA6
		{LPC_GPIO2, 1<< 7},						//ARMduino Pin  7 = PA7
		{LPC_GPIO2, 1<< 8},						//ARMduino Pin  8 = PA8
		{LPC_GPIO2, 1<< 9},						//ARMduino Pin  9 = PA9
		{LPC_GPIO2, 1<<10},						//ARMduino Pin 10 = PA10
		{LPC_GPIO2, 1<<11},						//ARMduino Pin 11 = PA11
		{LPC_GPIO2, 1<<12},						//ARMduino Pin 12 = PA12
		{LPC_GPIO2, 1<<13},						//ARMduino Pin 13 = PA13
		{LPC_GPIO2, 1<<14},						//ARMduino Pin 14 = PA14
		{LPC_GPIO2, 1<<15},						//ARMduino Pin 15 = PA15
		{LPC_GPIO2, 1<<16},						//ARMduino Pin  0 = PA0
		{LPC_GPIO2, 1<<17},						//ARMduino Pin  1 = PA1
		{LPC_GPIO2, 1<<18}, 					//ARMduino Pin  2 = PA2
		{LPC_GPIO2, 1<<19},						//ARMduino Pin  3 = PA3
		{LPC_GPIO2, 1<<20},						//ARMduino Pin  4 = PA4
		{LPC_GPIO2, 1<<21},						//ARMduino Pin  5 = PA5
		{LPC_GPIO2, 1<<22},						//ARMduino Pin  6 = PA6
		{LPC_GPIO2, 1<<23},						//ARMduino Pin  7 = PA7
		{LPC_GPIO2, 1<<24},						//ARMduino Pin  8 = PA8
		{LPC_GPIO2, 1<<25},						//ARMduino Pin  9 = PA9
		{LPC_GPIO2, 1<<26},						//ARMduino Pin 10 = PA10
		{LPC_GPIO2, 1<<27},						//ARMduino Pin 11 = PA11
		{LPC_GPIO2, 1<<28},						//ARMduino Pin 12 = PA12
		{LPC_GPIO2, 1<<29},						//ARMduino Pin 13 = PA13
		{LPC_GPIO2, 1<<30},						//ARMduino Pin 14 = PA14
		{LPC_GPIO2, 1<<31},						//ARMduino Pin 15 = PA15
	
