dannyf00/ARMduino/LPC17xx/armduino_lpc17xx.c
		{LPC_GPIO3, 1<< 0},						//ARMduino Pin  0 = PA0
		{LPC_GPIO3, 1<< 1},						//ARMduino Pin  1 = PA1
		{LPC_GPIO3, 1<< 2}, 					//ARMduino Pin  2 = PA2
		{LPC_GPIO3, 1<< 3},						//ARMduino Pin  3 = PA3
		{LPC_GPIO3, 1<< 4},						//ARMduino Pin  4 = PA4
		{LPC_GPIO3, 1<< 5},						//ARMduino Pin  5 = PA5
		{LPC_GPIO3, 1<< 6},						//ARMduino Pin  6 = PA6
		{LPC_GPIO3, 1<< 7},						//ARMduino Pin  7 = PA7
		{LPC_GPIO3, 1<< 8},						//ARMduino Pin  8 = PA8
		{LPC_GPIO3, 1<< 9},						//ARMduino Pin  9 = PA9
		{LPC_GPIO3, 1<<10},						//ARMduino Pin 10 = PA10
		{LPC_GPIO3, 1<<11},						//ARMduino Pin 11 = PA11
		{LPC_GPIO3, 1<<12},						//ARMduino Pin 12 = PA12
		{LPC_GPIO3, 1<<13},						//ARMduino Pin 13 = PA13
		{LPC_GPIO3, 1<<14},						//ARMduino Pin 14 = PA14
		{LPC_GPIO3, 1<<15},						//ARMduino Pin 15 = PA15
		{LPC_GPIO3, 1<<16},						//ARMduino Pin  0 = PA0
		{LPC_GPIO3, 1<<17},						//ARMduino Pin  1 = PA1
		{LPC_GPIO3, 1<<18}, 					//ARMduino Pin  2 = PA2
		{LPC_GPIO3, 1<<19},						//ARMduino Pin  3 = PA3
		{LPC_GPIO3, 1<<20},						//ARMduino Pin  4 = PA4
		{LPC_GPIO3, 1<<21},						//ARMduino Pin  5 = PA5
		{LPC_GPIO3, 1<<22},						//ARMduino Pin  6 = PA6
		{LPC_GPIO3, 1<<23},						//ARMduino Pin  7 = PA7
		{LPC_GPIO3, 1<<24},						//ARMduino Pin  8 = PA8
		{LPC_GPIO3, 1<<25},						//ARMduino Pin  9 = PA9
		{LPC_GPIO3, 1<<26},						//ARMduino Pin 10 = PA10
		{LPC_GPIO3, 1<<27},						//ARMduino Pin 11 = PA11
		{LPC_GPIO3, 1<<28},						//ARMduino Pin 12 = PA12
		{LPC_GPIO3, 1<<29},						//ARMduino Pin 13 = PA13
		{LPC_GPIO3, 1<<30},						//ARMduino Pin 14 = PA14
		{LPC_GPIO3, 1<<31},						//ARMduino Pin 15 = PA15
	
		{LPC_GPIO4, 1<< 0},						//ARMduino Pin  0 = PA0
		{LPC_GPIO4, 1<< 1},						//ARMduino Pin  1 = PA1
		{LPC_GPIO4, 1<< 2}, 					//ARMduino Pin  2 = PA2
		{LPC_GPIO4, 1<< 3},						//ARMduino Pin  3 = PA3
		{LPC_GPIO4, 1<< 4},						//ARMduino Pin  4 = PA4
		{LPC_GPIO4, 1<< 5},						//ARMduino Pin  5 = PA5
		{LPC_GPIO4, 1<< 6},						//ARMduino Pin  6 = PA6
		{LPC_GPIO4, 1<< 7},						//ARMduino Pin  7 = PA7
		{LPC_GPIO4, 1<< 8},						//ARMduino Pin  8 = PA8
		{LPC_GPIO4, 1<< 9},						//ARMduino Pin  9 = PA9
		{LPC_GPIO4, 1<<10},						//ARMduino Pin 10 = PA10
		{LPC_GPIO4, 1<<11},						//ARMduino Pin 11 = PA11
		{LPC_GPIO4, 1<<12},						//ARMduino Pin 12 = PA12
		{LPC_GPIO4, 1<<13},						//ARMduino Pin 13 = PA13
		{LPC_GPIO4, 1<<14},						//ARMduino Pin 14 = PA14
		{LPC_GPIO4, 1<<15},						//ARMduino Pin 15 = PA15
		{LPC_GPIO4, 1<<16},						//ARMduino Pin  0 = PA0
		{LPC_GPIO4, 1<<17},						//ARMduino Pin  1 = PA1
		{LPC_GPIO4, 1<<18}, 					//ARMduino Pin  2 = PA2
		{LPC_GPIO4, 1<<19},						//ARMduino Pin  3 = PA3
		{LPC_GPIO4, 1<<20},						//ARMduino Pin  4 = PA4
		{LPC_GPIO4, 1<<21},						//ARMduino Pin  5 = PA5
		{LPC_GPIO4, 1<<22},						//ARMduino Pin  6 = PA6
		{LPC_GPIO4, 1<<23},						//ARMduino Pin  7 = PA7
		{LPC_GPIO4, 1<<24},						//ARMduino Pin  8 = PA8
		{LPC_GPIO4, 1<<25},						//ARMduino Pin  9 = PA9
		{LPC_GPIO4, 1<<26},						//ARMduino Pin 10 = PA10
		{LPC_GPIO4, 1<<27},						//ARMduino Pin 11 = PA11
		{LPC_GPIO4, 1<<28},						//ARMduino Pin 12 = PA12
		{LPC_GPIO4, 1<<29},						//ARMduino Pin 13 = PA13
		{LPC_GPIO4, 1<<30},						//ARMduino Pin 14 = PA14
		{LPC_GPIO4, 1<<31},						//ARMduino Pin 15 = PA15
	
};


//Arduino Functions: GPIO
//set a pin mode to INPUT or OUTPUT
//no error checking on PIN
inline void pinMode(PIN_TypeDef pin, uint8_t mode) {
	//simple implementation - just INPUT/OUTPUT supported
	//if (mode==INPUT) GIO_IN(GPIO_PinDef[pin].gpio, GPIO_PinDef[pin].mask);
	//else GIO_OUT(GPIO_PinDef[pin].gpio, GPIO_PinDef[pin].mask);

	//fancier implementation: supports INPUT, INPUT_PULLUP, OUTPUT
	//additional features commented out
	switch (mode) {
	case INPUT: 		GIO_IN(GPIO_PinDef[pin].gpio, GPIO_PinDef[pin].mask); break;			//floating input
	//case INPUT_PULLUP: 	GIO_IN(GPIO_PinDef[pin].gpio, GPIO_PinDef[pin].mask); GIO_SET(GPIO_PinDef[pin].gpio, GPIO_PinDef[pin].mask); break;			//input with pullup
	//case INPUT_PULLDN:	GPIO_DDR(GPIO_PinDef[pin].gpio, GPIO_PinDef[pin].mask, GPIOMODE_INDN); GIO_CLR(GPIO_PinDef[pin].gpio, GPIO_PinDef[pin].mask); break;			//input with pulldown
	//case INPUT_ANALOG:	GPIO_DDR(GPIO_PinDef[pin].gpio, GPIO_PinDef[pin].mask, GPIOMODE_INAN); break;			//analog input
	case OUTPUT:		GIO_OUT(GPIO_PinDef[pin].gpio, GPIO_PinDef[pin].mask); break;			//floating input
	//case OUTPUT_OD:		GPIO_DDR(GPIO_PinDef[pin].gpio, GPIO_PinDef[pin].mask, GPIOMODE_OUTOD); break;			//floating input
	//case OUTPUT_AFPP:	GPIO_DDR(GPIO_PinDef[pin].gpio, GPIO_PinDef[pin].mask, GPIOMODE_AFPP); break;			//floating input
	//case OUTPUT_AFOD:	GPIO_DDR(GPIO_PinDef[pin].gpio, GPIO_PinDef[pin].mask, GPIOMODE_AFOD); break;			//floating input
	default: break;			//do nothing
	}

}

//set / clear a pin
inline void digitalWrite(PIN_TypeDef pin, uint8_t val) {
	if (val==LOW) GIO_CLR(GPIO_PinDef[pin].gpio, GPIO_PinDef[pin].mask);
	else GIO_SET(GPIO_PinDef[pin].gpio, GPIO_PinDef[pin].mask);
}

//read a pin
inline int digitalRead(PIN_TypeDef pin) {
	return (GIO_GET(GPIO_PinDef[pin].gpio, GPIO_PinDef[pin].mask))?HIGH:LOW;
}
//end GPIO

#if defined(USE_PWM)
//analogWrite
void analogWrite(PIN_TypeDef pin, uint16_t dc) {
	dc=(dc>PWM_PR)?PWM_PR:dc;				//bound dc to [0..PWM_PR]
	switch (pin) {							//configure TIMx-OCi channels based on pin # -> for STM32F100
#if defined(TIM1)
	case PA8:									//pin 8 = PA8/TIM1-CH1
		GIO_AFPP(GPIO_PinDef[8].gpio, GPIO_PinDef[8].mask);
		TIM1->CCR1 = dc;					//set duty cycle
		TIM1->CCER|= (1<<(4*(1-1)));		//1->enable the output
		break;
	case PA9:									//pin 9 = PA9/TIM1-CH2
		GIO_AFPP(GPIO_PinDef[9].gpio, GPIO_PinDef[9].mask);
		TIM1->CCR2 = dc;					//set duty cycle
		TIM1->CCER|= (1<<(4*(2-1)));		//1->enable the output
		break;
	case PA10:								//pin 10 = PA10/TIM1-CH3
		GIO_AFPP(GPIO_PinDef[10].gpio, GPIO_PinDef[10].mask);
		TIM1->CCR3 = dc;					//set duty cycle
		TIM1->CCER|= (1<<(4*(3-1)));		//1->enable the output
		break;
	case PA11:								//pin 11 = PA11/TIM1-CH4
		GIO_AFPP(GPIO_PinDef[11].gpio, GPIO_PinDef[11].mask);
		TIM1->CCR4 = dc;					//set duty cycle
		TIM1->CCER|= (1<<(4*(4-1)));		//1->enable the output
		break;
#endif
#if defined(TIM2)
	case PA1:									//pin 1 = PA1/TIM2-CH2
		GIO_AFPP(GPIO_PinDef[1].gpio, GPIO_PinDef[1].mask);
		TIM2->CCR2 = dc;					//set duty cycle
		TIM2->CCER|= (1<<(4*(2-1)));		//1->enable the output
		break;
	case PA2:									//pin 2 = PA2/TIM2-CH3
		GIO_AFPP(GPIO_PinDef[2].gpio, GPIO_PinDef[2].mask);
		TIM2->CCR3 = dc;					//set duty cycle
		TIM2->CCER|= (1<<(4*(3-1)));		//1->enable the output
		break;
	case PA3:									//pin 3 = PA3/TIM2-CH4
		GIO_AFPP(GPIO_PinDef[3].gpio, GPIO_PinDef[3].mask);
		TIM2->CCR4 = dc;					//set duty cycle
		TIM2->CCER|= (1<<(4*(4-1)));		//1->enable the output
		break;
#endif
#if defined(TIM3)
	case PA6:									//pin 6 = PA6/TIM3-CH1
		GIO_AFPP(GPIO_PinDef[6].gpio, GPIO_PinDef[6].mask);
		TIM3->CCR1 = dc;					//set duty cycle
		TIM3->CCER|= (1<<(4*(1-1)));		//1->enable the output
		break;
	case PA7:									//pin 7 = PA7/TIM3-CH2
		GIO_AFPP(GPIO_PinDef[7].gpio, GPIO_PinDef[7].mask);
		TIM3->CCR2 = dc;					//set duty cycle
		TIM3->CCER|= (1<<(4*(2-1)));		//1->enable the output
		break;
	case PB0:								//pin 16 = PB0/TIM3-CH3
		GIO_AFPP(GPIO_PinDef[16].gpio, GPIO_PinDef[16].mask);
		TIM3->CCR3 = dc;					//set duty cycle
		TIM3->CCER|= (1<<(4*(3-1)));		//1->enable the output
		break;
	case PB1:								//pin 17 = PB1/TIM3-CH4
		GIO_AFPP(GPIO_PinDef[17].gpio, GPIO_PinDef[17].mask);
		TIM3->CCR4 = dc;					//set duty cycle
		TIM3->CCER|= (1<<(4*(4-1)));		//1->enable the output
		break;
#endif
#if defined(TIM4)
	case PB6:								//pin 22 = PB6/TIM4-CH1
		GIO_AFPP(GPIO_PinDef[22].gpio, GPIO_PinDef[22].mask);
		TIM4->CCR1 = dc;					//set duty cycle
		TIM4->CCER|= (1<<(4*(1-1)));		//1->enable the output
		break;
	case PB7:								//pin 23 = PB7/TIM4-CH2
		GIO_AFPP(GPIO_PinDef[23].gpio, GPIO_PinDef[23].mask);
		TIM4->CCR2 = dc;					//set duty cycle
		TIM4->CCER|= (1<<(4*(2-1)));		//1->enable the output
		break;
	case PB8:								//pin 24 = PB8/TIM4-CH3
		GIO_AFPP(GPIO_PinDef[24].gpio, GPIO_PinDef[24].mask);
		TIM4->CCR3 = dc;					//set duty cycle
		TIM4->CCER|= (1<<(4*(3-1)));		//1->enable the output
		break;
	case PB9:								//pin 25 = PB9/TIM4-CH4
		GIO_AFPP(GPIO_PinDef[25].gpio, GPIO_PinDef[25].mask);
		TIM4->CCR4 = dc;					//set duty cycle
		TIM4->CCER|= (1<<(4*(4-1)));		//1->enable the output
		break;
#endif
	default: break;
	}

